app/views/recipes/show.html.erb


  <% @recipe.ingredients.each do |ingredients| %>
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 1]]