app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def index
    @ingredients = Ingredient.all

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "ingredients" ("name", "quantity", "unit", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Pan"], ["quantity", 2.0], ["unit", "u"], ["recipe_id", 7], ["created_at", "2020-04-10 10:50:00.080396"], ["updated_at", "2020-04-10 10:50:00.080396"]]
---
  def create
    @recipe = Recipe.find(params[:recipe_id])
    @ingredient = @recipe.ingredients.create(ingredient_params)