app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def edit
    @recipe = Recipe.find(params[:id])

INSERT INTO "recipes" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sss"], ["text", "sss"], ["created_at", "2020-04-05 19:03:28.684923"], ["updated_at", "2020-04-05 19:03:28.684923"]]
---
  def create
   @recipe = Recipe.new(recipe_params)

   @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 2]]
---
  def destroy
  @recipe = Recipe.find(params[:id])
  @recipe.destroy